DimaFantasy/LPP/LPP_STM32F103C8Tx/Core/Src/main.c
        TIM2->CR1 |= TIM_CR1_CEN;
    }

    X_MOTOR_MODE = mode;
}

/**
 * @brief Программная задержка dead-time между переключением ключей моста
 * ~0.7 мкс при 72МГц. Подобрать осциллографом!
 */
__STATIC_INLINE void XMotorDeadTime(void) {
    for (volatile int i = 0; i < 50; i++) { __NOP(); }
}

// Желаемое направление
static volatile uint8_t X_DIR_NEXT = 0; // 0 = вперёд, 1 = назад

void TIM2_IRQHandler(void) {
    uint32_t sr = TIM2->SR;

    if (sr & TIM_SR_UIF) {
        TIM2->SR = ~TIM_SR_UIF;

        XTimerCallback();

        if (X_MOTOR_MODE != X_MOTOR_MODE_STEP) {

            // ✅ Сброс пинов с учётом режима
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
            // PIN_X_MO_R — DIR в ONE_PWM, сбрасываем только в TWO_PWM
            if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
                F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            }

            if (X_PWM_CURRENT != 0) {
                XMotorDeadTime();

                if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
                    uint32_t abs_pwr = (uint32_t)abs(X_PWM_CURRENT);
                    if (abs_pwr > 5000) abs_pwr = 5000;
                    TIM2->CCR1 = abs_pwr;

                    uint8_t fwd = (X_PWM_CURRENT > 0) ? 1 : 0;
                    if (W_X_POL_PWM) fwd = !fwd;

                    if (fwd) {
                        F_SET_PIN(&g_pins[PIN_X_MO_L]);
                        F_SET_PIN(&g_pins[PIN_X_MO_R_H]);
                    } else {
                        F_SET_PIN(&g_pins[PIN_X_MO_R]);
                        F_SET_PIN(&g_pins[PIN_X_MO_L_H]);
                    }
                }
                else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) {
                    uint32_t abs_pwr = (uint32_t)abs(X_PWM_CURRENT);
                    if (abs_pwr > 5000) abs_pwr = 5000;
                    TIM2->CCR1 = abs_pwr;

                    // DIR уже выставлен в CC1IF — не трогаем
                    X_PWM_SET();
                }
            }
        }
    }

    if (sr & TIM_SR_CC1IF) {
        TIM2->SR = ~TIM_SR_CC1IF;

        if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
            // ✅ Гасим все ключи — в TWO_PWM PIN_X_MO_R это ключ моста
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        }
        else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) {
            // Гасим только ШИМ, DIR (PIN_X_MO_R) не трогаем
            X_PWM_CLR();

            // Обновляем DIR в паузе между импульсами
            X_DIR_NEXT = (X_PWM_CURRENT >= 0) ? 0 : 1;
            if (X_DIR_NEXT) X_DIR_SET();
            else            X_DIR_CLR();
        }
    }
}

/**
 * @brief Установка длительности шага (только для STEP режима)
 * @param period: длительность в мкс (при PSC=71, 1 тик = 1 мкс)
 */
void XTimerSet(uint16_t period) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) {
        TIM2->ARR  = period;
        TIM2->CNT  = 0;
        TIM2->SR   = 0;             // сброс UIF перед стартом
        TIM2->CR1 |= TIM_CR1_CEN;  // старт одного импульса (OPM)
    }
}

/**
 * @brief Установка мощности мотора X
 * @param power: -5000..+5000 (0 = стоп)
 */
void XMotorSet(int power) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) return;

    if (abs(power) < 10) power = 0;

    X_PWM_CURRENT = power;

    if (power == 0) {
        TIM2->CCR1 = 0;
        F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
        F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        X_DIR_CLR();
        X_PWM_CLR();
        X_DIR_NEXT = 0; // ✅ сброс желаемого направления
    } else {
        if (power >  5000) power =  5000;
        if (power < -5000) power = -5000;
        TIM2->CCR1 = (uint32_t)abs(power);
    }
}

// ============================================================================
// СЕКЦИЯ: ЛАЗЕР И ПОДСВЕТКА (TIM1 + DMA1)
// ============================================================================

// ============================================================================
// Принцип работы:
// 1. LASER: Включение по TIM1_UP (0), выключение по CCR1 (val).
// 2. LED1/LED2: "Инверсная" логика для общего сброса.
//    - Включение: Каждому свой CCR (CCR4 для LED1, CCR3 для LED2).
//    - Точка включения = (100 - val). Чем больше яркость, тем раньше старт.
//    - Выключение: ОБЩЕЕ по CCR2 (всегда 100) через один канал DMA.
//
// Ограничения:
// - LASER: Любой порт, любой пин.
// - LED1 & LED2: Обязательно на одном GPIO порту (используют общий BSRR).
// ============================================================================

// F103 маппинг TIM1 → DMA1 (жёстко в железе, не меняется):
void PWM_LaserLight_LinkHardware(void) {
    PIN_CFG_T *laser = &g_pins[PIN_PWM_LASER];
    PIN_CFG_T *led1  = &g_pins[PIN_PWM_LED1];
    PIN_CFG_T *led2  = &g_pins[PIN_PWM_LED2];

    // Останавливаем все каналы DMA перед перенастройкой
    DMA1_Channel5->CCR &= ~DMA_CCR_EN; // Laser ON
    DMA1_Channel2->CCR &= ~DMA_CCR_EN; // Laser OFF
    DMA1_Channel4->CCR &= ~DMA_CCR_EN; // LED1 ON
    DMA1_Channel3->CCR &= ~DMA_CCR_EN; // Common LED OFF (CH2)
    DMA1_Channel6->CCR &= ~DMA_CCR_EN; // LED2 ON
	
		// Перед перенастройкой сбрасывай текущие пины.
		if (laser->used) F_RESET_PIN(laser);
		if (led1->used)  F_RESET_PIN(led1);
		if (led2->used)  F_RESET_PIN(led2);	

    // Сброс флагов
    DMA1->IFCR = DMA_IFCR_CGIF2 | DMA_IFCR_CGIF3 | DMA_IFCR_CGIF4 |
                 DMA_IFCR_CGIF5 | DMA_IFCR_CGIF6;

    uint32_t ccr_base = DMA_CCR_DIR | DMA_CCR_CIRC | DMA_CCR_MSIZE_1 | 
                        DMA_CCR_PSIZE_1 | DMA_CCR_PL_Msk;

    // ----------------------------------------------------------------
    // ЛАЗЕР (Любой порт/пин)
    // ----------------------------------------------------------------
    if (laser->used && laser->bsrr != &GPIO_NULL_REG) {
        raw_pin_masks[0] = laser->pin;
        DMA1_Channel5->CPAR  = (uint32_t)laser->bsrr;
        DMA1_Channel5->CMAR  = (uint32_t)&dma_pwm_masks[0][0];
        DMA1_Channel5->CNDTR = 1;
        DMA1_Channel5->CCR   = ccr_base | DMA_CCR_EN;

        DMA1_Channel2->CPAR  = (uint32_t)laser->bsrr;
        DMA1_Channel2->CMAR  = (uint32_t)&dma_pwm_masks[0][1];
        DMA1_Channel2->CNDTR = 1;
        DMA1_Channel2->CCR   = ccr_base | DMA_CCR_EN;
    }

    // ----------------------------------------------------------------
    // ПОДСВЕТКА (LED1 и LED2)
    // ----------------------------------------------------------------
    
    // Проверка совместимости портов
    bool led1_active = (led1->used && led1->bsrr != &GPIO_NULL_REG);
    bool led2_active = (led2->used && led2->bsrr != &GPIO_NULL_REG);
    
    // Если оба активны, но порты РАЗНЫЕ — блокируем инициализацию подсветки
    if (led1_active && led2_active && (led1->bsrr != led2->bsrr)) {
        return; // Защита: порты не совпадают, ШИМ через общий сброс невозможен
    }

    // Настройка LED1
    if (led1_active) {
        raw_pin_masks[1] = led1->pin;
        // ON: TIM1_CH4
        DMA1_Channel4->CPAR  = (uint32_t)led1->bsrr;
        DMA1_Channel4->CMAR  = (uint32_t)&dma_pwm_masks[1][0];
        DMA1_Channel4->CNDTR = 1;
        DMA1_Channel4->CCR   = ccr_base | DMA_CCR_EN;

        // OFF: TIM1_CH2 (Общий канал выключения)
        DMA1_Channel3->CPAR  = (uint32_t)led1->bsrr;
        DMA1_Channel3->CMAR  = (uint32_t)&dma_pwm_masks[1][1];
        DMA1_Channel3->CNDTR = 1;
        DMA1_Channel3->CCR   = ccr_base | DMA_CCR_EN;
    }

    // Настройка LED2
    if (led2_active) {
        raw_pin_masks[2] = led2->pin;
        // ON: TIM1_CH3
        DMA1_Channel6->CPAR  = (uint32_t)led2->bsrr;
        DMA1_Channel6->CMAR  = (uint32_t)&dma_pwm_masks[2][0];
        DMA1_Channel6->CNDTR = 1;
        DMA1_Channel6->CCR   = ccr_base | DMA_CCR_EN;

